# ОШИБКИ ВВОДА ИНФОРМАЦИИ О ПОЕЗДКЕ
INCORRECT_INPUT = 'Пожалуйста, исправьте ошибки указанные ниже'

INCORRECT_POINT = 'Указанное место не найдено. Проверьте написание.'
ERROR_EMPTY_PLACE_DEPARTURE = 'Пожалуйста, укажите пункт отправления.'
ERROR_EMPTY_PLACE_BACKWARD = 'Пожалуйста, укажите пункт назначения.'
ERROR_CREATE_ROUTE = 'Не удалось проложить маршрут. Выберите другие пункты прибытия и отправления.'

ERROR_EMPTY_DATE_DEPARTURE = 'Пожалуйста, выберите дату отправления.'
ERROR_EMPTY_DATE_BACKWARD = 'Пожалуйста, укажите дату поездки обратно или выберите опцию поездки в одну сторону'
INCORRECT_DATE_DEPARTURE = 'Введите корректную дату поездки туда.'
INCORRECT_DATE_BACKWARD = 'Введите корректную дату поездки обратно.'
NON_ACTUAL_DATE_DEPARTURE = 'Дата отправления должна быть актуальной.'
NON_ACTUAL_DATE_BACKWARD = 'Выберите дату обратной поездки позже даты выезда.'

# ОШИБКИ ВВОДА ДЕТАЛЕЙ ПОЕЗДКИ
ERROR_CONFIRM_DRIVERS_LICENSE = 'Чтобы иметь возможность публиковать поездки, вы должны подтвердить наличие ' \
                                'водительских прав и действующей страховки на автомобиль.'
ERROR_COUNT_SEATS_MORE_ALLOWABLE = 'Количество мест не должно превышать 8'
ERROR_COUNT_SEATS_LESS_ALLOWABLE = 'Количество мест не должно быть меньше 1'

# ОШИБКИ ВВОДА РЕГИСТРАЦИОННЫХ ДАННЫХ
ERROR_EMPTY_GENDER = 'Укажите пол'
ERROR_EMPTY_NAME = 'Укажите имя'
INCORRECT_NAME = 'Введите корректное имя (только буквы).'
INCORRECT_SURNAME = 'Имя указано некорректно (допускаются только буквы и дефисы)'
INCORRECT_EMAIL = 'Укажите действующую электронную почту'
ERROR_ALREADY_USE_EMAIL = 'Эта эл. почта уже используется'
ERROR_EMPTY_PASSWORD = 'Введите пароль'
ERROR_SHORT_PASSWORD = 'Минимальная длина пароля — 8 символов.'
ERROR_CONFIRM_PASSWORD = 'This value is not valid.'
ERROR_EMPTY_CONFIRM_PASSWORD = 'Подтвердите пароль'
ERROR_EMPTY_YEAR_OF_BIRTH = 'Укажите свой год рождения'


name_month = {"янв.": "01", "фев.": "02", "марта": "03", "апр.": "04", "мая": "05", "июня": "06",
              "июля": "07", "авг.": "08", "сент.": "09", "окт.": "10", "ноябр.": "11", "дек.": "12"}
